Use mermaid diagram for architecture section
Signed-off-by: Dawei Huang <daweihuang@microsoft.com>
